app/views/books/_index.html.erb

          </td>
        <td><%= link_to "コメント数：#{book.book_comments.count}", book_path(book.id) %></td>
---
SELECT "books".* FROM "books"