app/controllers/books_controller.rb

  def index
    @book = Book.new
    to  = Time.current.at_end_of_day
    from  = (to - 6.day).at_beginning_of_day
    @books = Book.includes(:favorited_users).
      sort {|a,b|
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book)
      flash[:notice] = "You have created book successfully."
    else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "2io8h"], ["body", "t3le08gb3r2th518detc"], ["user_id", 2], ["created_at", "2021-10-25 17:41:16.046313"], ["updated_at", "2021-10-25 17:41:16.046313"]]
SELECT "books".* FROM "books"